'''
подключение импорта
pygame

подключение музыки ping_pong.ogg

создание текста для победы и проигрыша

создание всех переменных, необходимых для соблоюдения условия

создание класса GameSprite из sprite(из библиотеки pygame) для наследования из него других классов
#pass

создание класса Player(доска-игрок), наследованного из класса GameSprite
#pass

создание класса мячик Ball - наследник класса GameSprite
#pass

создание окна и установка к нему фона 'ping_pong.png'
установка названия игры 'ping pong'

создание экземпляров класса Player
#pass

создание экземпляра класса Ball
#pass

создание игрового цикла:
while game:
    проверка произошедших событий
        нажата ли кнопка выход?
        

    если игра не закончена:
        переместить игроков
        обновить игроков 
        обновить мяч
        обновить экран
    time.delay(50)
'''
